tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/services"
tap "microsoft/mssql-release"
# Zstandard is a real-time compression algorithm
brew "zstd"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# C library implementing the SSH2 protocol
brew "libssh2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Generic library support script
brew "libtool"
# Graphics library to dynamically manipulate images
brew "gd"
# Postgres C API library
brew "libpq"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Modern replacement for 'ls'
brew "exa"
# Fast and simple Node.js version manager
brew "fnm"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# OpenType text shaping engine
brew "harfbuzz"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Library to render SVG files using Cairo
brew "librsvg"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3", link: false
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pandoc filter for numbering and cross-referencing
brew "pandoc-crossref"
# Python version management
brew "pyenv"
# Python interface to Tcl/Tk
brew "python-tk@3.11"
# Cross-platform application and UI framework
brew "qt"
# Safe, concurrent, practical language
brew "rust"
# Cross-shell prompt for astronauts
brew "starship"
# CLI for generating a Software Bill of Materials from container images
brew "syft"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql18"
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools18"
# Data management tool that enables working with SQL Server
cask "azure-data-studio"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Web browser focusing on privacy
cask "brave-browser"
# App to build and share containerized applications and microservices
cask "docker"
# Developer platform
cask "dotnet-sdk"
# Assign keys, and then decorate and label them
cask "elgato-stream-deck"
# Reimagine your terminal
cask "fig"
# Collaborative team software
cask "figma"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Web browser
cask "google-chrome"
# JetBrains tools manager
cask "jetbrains-toolbox"
# WordPress local development tool by Flywheel
cask "local"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Native GUI tool for relational databases
cask "tableplus"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
mas "Bitwarden", id: 1352778147
mas "Compressor", id: 424390742
mas "Final Cut Pro", id: 424389933
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Motion", id: 434290957
mas "OneDrive", id: 823766827
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "alefragnani.Bookmarks"
vscode "alefragnani.project-manager"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "Angular.ng-template"
vscode "antfu.icons-carbon"
vscode "astro-build.astro-vscode"
vscode "azemoh.one-monokai"
vscode "batisteo.vscode-django"
vscode "bierner.emojisense"
vscode "bierner.markdown-mermaid"
vscode "blackmist.LinkCheckMD"
vscode "bmewburn.vscode-intelephense-client"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "ChakrounAnas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cipchk.cssrem"
vscode "cmoog.sqlnotebook"
vscode "codebook.codebook"
vscode "codezombiech.gitignore"
vscode "codingyu.laravel-goto-view"
vscode "cschlosser.doxdocgen"
vscode "csstools.postcss"
vscode "CucumberOpen.cucumber-official"
vscode "cweijan.vscode-mysql-client2"
vscode "Dart-Code.dart-code"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dendron.dendron"
vscode "dendron.dendron-markdown-shortcuts"
vscode "dendron.dendron-paste-image"
vscode "docsmsft.docs-article-templates"
vscode "docsmsft.docs-authoring-pack"
vscode "docsmsft.docs-build"
vscode "docsmsft.docs-images"
vscode "docsmsft.docs-linting"
vscode "docsmsft.docs-markdown"
vscode "docsmsft.docs-metadata"
vscode "docsmsft.docs-preview"
vscode "docsmsft.docs-scaffolding"
vscode "docsmsft.docs-visual-areas"
vscode "docsmsft.docs-yaml"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "donjayamanne.typescript-notebook"
vscode "DotJoshJohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "efoerster.texlab"
vscode "esbenp.prettier-vscode"
vscode "expertly-simple.ng-evergreen"
vscode "flyfly6.terminal-in-status-bar"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "Fudge.auto-using"
vscode "GitHub.copilot"
vscode "GitHub.remotehub"
vscode "GitHub.vscode-pull-request-github"
vscode "glenn2223.live-sass"
vscode "golang.go"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-execution"
vscode "GraphQL.vscode-graphql-syntax"
vscode "Gruntfuggly.todo-tree"
vscode "Gydunhn.vsc-essentials"
vscode "heybourn.headwind"
vscode "hollowtree.vue-snippets"
vscode "James-Yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "JeffersonQin.latex-snippets-jeff"
vscode "jmrog.vscode-nuget-package-manager"
vscode "jock.svg"
vscode "johnpapa.Angular2"
vscode "johnpapa.pwa-tools"
vscode "johnpapa.vscode-cloak"
vscode "johnpapa.vscode-peacock"
vscode "jonkwheeler.styled-components-snippets"
vscode "josee9988.minifyall"
vscode "josetr.cmake-language-support-vscode"
vscode "jundat95.react-native-snippet"
vscode "kamikillerto.vscode-colorize"
vscode "kenhowardpdx.vscode-gist"
vscode "KevinRose.vsc-python-indent"
vscode "kisstkondoros.vscode-codemetrics"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "kreativ-software.csharpextensions"
vscode "leizongmin.node-module-intellisense"
vscode "matt-meyers.vscode-dbml"
vscode "MaxvanderSchee.web-accessibility"
vscode "mdickin.markdown-shortcuts"
vscode "mechatroner.rainbow-csv"
vscode "MehediDracula.php-namespace-resolver"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "miguelsolorio.symbols"
vscode "mikehanson.auto-barrel"
vscode "mikestead.dotenv"
vscode "mintlify.document"
vscode "moalamri.inline-fold"
vscode "mongodb.mongodb-vscode"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mrmlnc.vscode-pugbeautify"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-playwright.playwright"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-markdown-notebook"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mtxr.sqltools-driver-pg"
vscode "mvllow.rose-pine"
vscode "naumovs.color-highlight"
vscode "nickfode.latex-formatter"
vscode "njpwerner.autodocstring"
vscode "notZaki.pandocciter"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel5-snippets"
vscode "patbenatar.advanced-new-file"
vscode "pflannery.vscode-versionlens"
vscode "PKief.material-icon-theme"
vscode "platformio.platformio-ide"
vscode "pranaygp.vscode-css-peek"
vscode "quick-lint.quick-lint-js"
vscode "RapidAPI.vscode-rapidapi-client"
vscode "rapidapi.vscode-services"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "sdras.vue-vscode-snippets"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shufo.vscode-blade-formatter"
vscode "sreetamd.karma"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-spanish"
vscode "styled-components.vscode-styled-components"
vscode "tecosaur.latex-utilities"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "valentjn.vscode-ltex"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vitaliymaz.vscode-svg-previewer"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "wayou.vscode-todo-highlight"
vscode "willstakayama.vscode-nextjs-snippets"
vscode "withfig.fig"
vscode "wix.vscode-import-cost"
vscode "wmaurer.change-case"
vscode "xabikos.JavaScriptSnippets"
vscode "xdebug.php-debug"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "Zignd.html-css-class-completion"
vscode "ZixuanChen.vitest-explorer"
vscode "zobo.php-intellisense"
